# A Minimalist's Wardrobe - Database
### Project by Zachary Jackson 
##### This is a personal project created by to highlight SQL skills, using Python and a Jupyter notebooks so the output from the SQL queries can be shown.

<img src="https://www.minimalismmadesimple.com/wp-content/uploads/2021/02/minimalist-wardrobe-men.png" width="200px" height="50%">

## Introduction

**Business Context.** I feel like I have always lived with a minimalist mindset, but I have been making a meaningful attempt to practice minimalism since about 2015. That was the year I discover the Minimalists' book titled *Everything that Remains*. Since then, I have read a number of books around minimalism. My latest favorite is *The Afrominimalist's Guide to Living with Less* by Christine Platt. These have changed the way I look at material things and the meaning of life and living as well. 

One way I practice is with my wardrobe. I have staples in my wardrobe that I mix and match to make it seem like I have an expansive wardrobe. Fashionistas/fashionistos call it a 'capsule wardrobe,' but it is essentially minimalism. Some people shy away from the word, but let's call a spade a spade!
I have my staple items and bring new life to my closet by accessorizing. I typically try to hold on to items for at least 5 years, but given that I have relocated 3 times in the past 5 years, I have not tracked or made conscious efforts to hold on to things as long as I usually do. Sometimes it feels easier to let go of it all and start fresh especially when moving across the nation twice! Now that I settled in Fort Worth for the time being, I want to catalog the items I worn/used the most in 2023. I want to include information such as the name, description, how I would categorize the item, where I keep/store the items, and how long I have had the items. 

**Business Problem.** Create a table or tables that has the data of interests and formulate questions that will help align with me better align with the minimalist lifestyle I want to live.  

**Analytical Context.** I am starting from scratch. It is laundry day and I am writing down the items I wore the past week and listing the items I know that I have worn in the past month (clothes worn while traveling not included). 

1. Convert items on hand written list into a table
2. Create multiple tables if that will make final product more readable
3. Write queries to answer the following questions:
    * How many items are frequently used in my wardrobe?
    * What are the oldest items that I still frequently use?
    * What is the average number of years I've own items in your wardrobe by category?
    * Where are all my accessories located and how many are in each location?

[This text goes to the original SQL code repository for this project!](https://github.com/zajacksonphd/SQL/blob/main/A%20Minimalist's%20Wardrobe%20-%20Database)

In [1]:
# import libraries

import pandas as pd
import sqlite3
import sqlalchemy

In [2]:
#Load the SQL Module
%load_ext sql

#Establish Connection
sqlalchemy.create_engine('postgresql://postgres:postgres@localhost:5433/Personal Projects')
%sql postgresql://postgres:postgres@localhost:5433/PersonalProjects

### Creating the Wardrobe Table

The first SQL statement creates the wardrobe table and sets up the columns to be used in the table. The columns include id, name, description, category, purpose, years_owned, and location. Each column is given a data type, such as INTEGER, TEXT, or NUMERIC.

In [3]:
%%sql
-- Drop the wardrobe table if it already exists
DROP TABLE IF EXISTS wardrobe;

-- Create a table that lists my most frequestly worn/used items in my closet
CREATE TABLE wardrobe (
	id INTEGER, 
	name TEXT, 
	description TEXT, 
	category TEXT, 
	purpose TEXT, 
	years_owned NUMERIC, 
	location TEXT);

 * postgresql://postgres:***@localhost:5433/PersonalProjects
Done.
Done.

[]

### Inserting Data into the Wardrobe Table

The next set of SQL statements add data to the wardrobe table. Each statement uses the INSERT INTO command, which specifies the table name and the values to be inserted into the table for each column. The values are enclosed in parentheses and separated by commas. For example, the following statement inserts data for a pair of Batman Chuck Taylor Converse shoes:

In [4]:
%%sql
--Insert the items into the table
INSERT INTO wardrobe VALUES (1, 'Batman Chuck Taylor Converse', 'Low top: Black/multi-color', 'shoes', 'casual wear', 5, 'shoe rack');
INSERT INTO wardrobe VALUES (20, 'Comme des Garcons Chuck Taylor Converse', 'Low top: grey/black', 'shoes', 'multipurpose', 2, 'shoe rack');
INSERT INTO wardrobe VALUES (10, 'Chuck 70 Vintage Canvas', 'Mid top: parchment/garnet/egret', 'shoes', 'multipurpose', 1, 'shoe rack');
INSERT INTO wardrobe VALUES (5, 'Walk London loafers', 'platform, black, rounded-toe, square design on tongue of shoe', 'shoes', 'multipurpose', 1, 'in box');
INSERT INTO wardrobe VALUES (2, 'fleece hoodie', 'fuzzy, black w/ front pockets', 'outerwear', 'casual wear', 3, 'hanging hook near door');
INSERT INTO wardrobe VALUES (99, 'lightweight hoodie', 'thin, cotton, yellow, no pockets', 'outerwear', 'casual wear', 3, 'hanging hook near door');
INSERT INTO wardrobe VALUES (13, 'Levi 550', 'relaxed fit, light blue denim', 'pants', 'casual wear', 2, 'closet');
INSERT INTO wardrobe VALUES (9, 'Calvin Klein jean', 'fitted and tailored, black denim', 'pants', 'dressy casual', 2, 'closet');
INSERT INTO wardrobe VALUES (55, 'ribbed shirt', 'short-sleeved, black, fitted', 'shirts', 'casual wear/dressy causal', 2, 'closet');
INSERT INTO wardrobe VALUES (3, 't-shirt', 'plain, white, pocketed', 'shirts', 'casual wear', 5, 'bathroom drawer');
INSERT INTO wardrobe VALUES (21, 'beanie', 'satin-lined, grey', 'outerwear', 'casual wear', 3, 'closet');
INSERT INTO wardrobe VALUES (100, 'hair tie', 'thick, black', 'accessory', 'everyday', .5, 'bathroom drawer');
INSERT INTO wardrobe VALUES (4, 'computer glasses', 'amber lens, black circle frames, blue-light protection', 'accessory', 'multipurpose', 1, 'glasses case in backpack');
INSERT INTO wardrobe VALUES (5, 'Cellular Apple Watch', 'black, knit band', 'accessory', 'multipurpose', 1, 'nightstand');
INSERT INTO wardrobe VALUES (6, 'thin line ring', 'pinky ring (gold)', 'accessory', 'multipurpose', 4, 'nightstand');
INSERT INTO wardrobe VALUES (7, 'eagle ring', 'index ring (silver/gold)', 'accessory', 'multipurpose', 4, 'nightstand');
INSERT INTO wardrobe VALUES (8, '"wings" ring', 'pinky ring (silver)', 'accessory', 'multipurpose', 4, 'nightstand');
INSERT INTO wardrobe VALUES (11, '"sun/moon" ring', 'thumb ring (gold)', 'accessory', 'multipurpose', 4, 'nightstand');
INSERT INTO wardrobe VALUES (77, 'Gold Toe Socks', 'white, tube', 'socks', 'multipurpose', 1, 'dresser');
INSERT INTO wardrobe VALUES (78, 'Hanes Socks', 'no show, multicolor', 'socks', 'multipurpose', 4, 'dresser');


-- View wardrobe table
SELECT 
	*
    FROM wardrobe
    LIMIT 5;

 * postgresql://postgres:***@localhost:5433/PersonalProjects
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
5 rows affected.

[(1, 'Batman Chuck Taylor Converse', 'Low top: Black/multi-color', 'shoes', 'casual wear', Decimal('5'), 'shoe rack'),
 (20, 'Comme des Garcons Chuck Taylor Converse', 'Low top: grey/black', 'shoes', 'multipurpose', Decimal('2'), 'shoe rack'),
 (10, 'Chuck 70 Vintage Canvas', 'Mid top: parchment/garnet/egret', 'shoes', 'multipurpose', Decimal('1'), 'shoe rack'),
 (5, 'Walk London loafers', 'platform, black, rounded-toe, square design on tongue of shoe', 'shoes', 'multipurpose', Decimal('1'), 'in box'),
 (2, 'fleece hoodie', 'fuzzy, black w/ front pockets', 'outerwear', 'casual wear', Decimal('3'), 'hanging hook near door')]

***Table is text heavy! This needs to be more user friendly!***

***Since the wardrobe table is currently text-heavy, I need to create a more user-friendly table that replaces some of the text with integers by creating a table that maps each category to a unique integer identifier***

### Creating Lookup Tables

The next set of SQL statements creates two lookup tables that will be used to update the category and purpose columns of the wardrobe table with integer values. The category_lookup table contains category names and their corresponding integer values, while the purpose_lookup table contains purpose names and their corresponding integer values. Each table is created using the CREATE TABLE statement, and the INSERT INTO statement is used to insert data into the tables.

#### Category Table

In [5]:
%%sql
CREATE TABLE category_lookup (
	category_id INTEGER PRIMARY KEY,
	category TEXT);

INSERT INTO category_lookup VALUES (1, 'accessory');
INSERT INTO category_lookup VALUES (2, 'outerwear');
INSERT INTO category_lookup VALUES (3, 'pants');
INSERT INTO category_lookup VALUES (4, 'shirts');
INSERT INTO category_lookup VALUES (5, 'shoes');
INSERT INTO category_lookup VALUES (6, 'socks');

SELECT 
	*
    	FROM category_lookup;

 * postgresql://postgres:***@localhost:5433/PersonalProjects
(psycopg2.errors.DuplicateTable) relation "category_lookup" already exists

[SQL: CREATE TABLE category_lookup (
	category_id INTEGER PRIMARY KEY,
	category TEXT);]
(Background on this error at: https://sqlalche.me/e/20/f405)

#### Purpose Table

In [6]:
%%sql
CREATE TABLE purpose_lookup (
	purpose_id INTEGER PRIMARY KEY,
	purpose TEXT);

INSERT INTO purpose_lookup VALUES (1, 'accessory');
INSERT INTO purpose_lookup VALUES (2, 'casual wear');
INSERT INTO purpose_lookup VALUES (3, 'multipurpose');
INSERT INTO purpose_lookup VALUES (4, 'dressy casual');
INSERT INTO purpose_lookup VALUES (5, 'everyday');

-- View the purpose_lookup table
SELECT
	*
	FROM purpose_lookup;

 * postgresql://postgres:***@localhost:5433/PersonalProjects
(psycopg2.errors.DuplicateTable) relation "purpose_lookup" already exists

[SQL: CREATE TABLE purpose_lookup (
	purpose_id INTEGER PRIMARY KEY,
	purpose TEXT);]
(Background on this error at: https://sqlalche.me/e/20/f405)

#### Location Table

In [7]:
%%sql
-- Create the location_lookup table with a primary key constraint
CREATE TABLE location_lookup (
	location_id INTEGER PRIMARY KEY,
	location TEXT);

-- Insert values into location_lookup table
INSERT INTO location_lookup VALUES (1, 'accessory');
INSERT INTO location_lookup VALUES (2, 'bathroom drawer');
INSERT INTO location_lookup VALUES (3, 'closet');
INSERT INTO location_lookup VALUES (4, 'dresser');
INSERT INTO location_lookup VALUES (5, 'backpack');
INSERT INTO location_lookup VALUES (6, 'hanging hook near door');
INSERT INTO location_lookup VALUES (7, 'in box');
INSERT INTO location_lookup VALUES (8, 'nightstand');
INSERT INTO location_lookup VALUES (9, 'shoe rack');

-- View the location_lookup table
SELECT
	*
	FROM location_lookup;

 * postgresql://postgres:***@localhost:5433/PersonalProjects
(psycopg2.errors.DuplicateTable) relation "location_lookup" already exists

[SQL: -- Create the location_lookup table with a primary key constraint
CREATE TABLE location_lookup (
	location_id INTEGER PRIMARY KEY,
	location TEXT);]
(Background on this error at: https://sqlalche.me/e/20/f405)

### Updating the Wardrobe Table

The last set of SQL statements update the wardrobe table by adding new columns and updating the data in existing columns. The first statement adds a new column named category_id to the wardrobe table. The ALTER TABLE statement is used to add the new column.

The next statement adds a foreign key constraint to the category_id column of the wardrobe table, linking it to the category_id column of the category_lookup table. This ensures that only valid category values are entered into the wardrobe table. This is repeated for the purpose table and the location table.

The last block shows the updated wardrobe table.

#### Category Table

In [8]:
%%sql

/* Adding category table and its foreign key to wardrobe table*/
-- Add a column to the table that gives the category a number 
ALTER TABLE wardrobe ADD category_id INTEGER;

-- Add the foreign key constraint to the wardrobe table
ALTER TABLE wardrobe ADD FOREIGN KEY (category_id) 
	REFERENCES category_lookup(category_id);

-- Update the wardrobe table to use the category IDs
UPDATE wardrobe 
	SET category_id = l.category_id
	FROM category_lookup l
	WHERE wardrobe.category = l.category;

 * postgresql://postgres:***@localhost:5433/PersonalProjects
Done.
Done.
20 rows affected.

[]

#### Purpose Table

In [9]:
%%sql
/* Adding purpose table and its foreign key to wardrobe table*/

-- Add a column to the table that gives the purpose a number
ALTER TABLE wardrobe ADD purpose_id INTEGER;

-- Add the foreign key constraint to the wardrobe table
ALTER TABLE wardrobe ADD FOREIGN KEY (purpose_id)
    REFERENCES purpose_lookup(purpose_id);

-- Update the wardrobe table to use the purpose IDs
UPDATE wardrobe
    SET purpose_id = p.purpose_id
    FROM purpose_lookup p
    WHERE wardrobe.purpose = p.purpose;

 * postgresql://postgres:***@localhost:5433/PersonalProjects
Done.
Done.
19 rows affected.

[]

#### Location Table

In [10]:
%%sql
-- Add a column to the table that gives the location a number
ALTER TABLE wardrobe ADD location_id INTEGER;

-- Add the foreign key constraint to the wardrobe table
ALTER TABLE wardrobe ADD FOREIGN KEY (location_id)
	REFERENCES location_lookup(location_id);

-- Update the wardrobe table to use the location IDs
UPDATE wardrobe
	SET location_id = l.location_id
	FROM location_lookup l
	WHERE wardrobe.location = l.location;

 * postgresql://postgres:***@localhost:5433/PersonalProjects
Done.
Done.
20 rows affected.

[]

#### Updated Wardrobe Table

In [11]:
%%sql
--View update table
SELECT
	*
    FROM wardrobe;

 * postgresql://postgres:***@localhost:5433/PersonalProjects
20 rows affected.

[(100, 'hair tie', 'thick, black', 'accessory', 'everyday', Decimal('0.5'), 'bathroom drawer', 1, 5, 2),
 (3, 't-shirt', 'plain, white, pocketed', 'shirts', 'casual wear', Decimal('5'), 'bathroom drawer', 4, 2, 2),
 (9, 'Calvin Klein jean', 'fitted and tailored, black denim', 'pants', 'dressy casual', Decimal('2'), 'closet', 3, 4, 3),
 (21, 'beanie', 'satin-lined, grey', 'outerwear', 'casual wear', Decimal('3'), 'closet', 2, 2, 3),
 (13, 'Levi 550', 'relaxed fit, light blue denim', 'pants', 'casual wear', Decimal('2'), 'closet', 3, 2, 3),
 (55, 'ribbed shirt', 'short-sleeved, black, fitted', 'shirts', 'casual wear/dressy causal', Decimal('2'), 'closet', 4, None, 3),
 (78, 'Hanes Socks', 'no show, multicolor', 'socks', 'multipurpose', Decimal('4'), 'dresser', 6, 3, 4),
 (77, 'Gold Toe Socks', 'white, tube', 'socks', 'multipurpose', Decimal('1'), 'dresser', 6, 3, 4),
 (4, 'computer glasses', 'amber lens, black circle frames, blue-light protection', 'accessory', 'multipurpose', Decimal('1'), 'glasses case in backpack', 1, 3, 5),
 (99, 'lightweight hoodie', 'thin, cotton, yellow, no pockets', 'outerwear', 'casual wear', Decimal('3'), 'hanging hook near door', 2, 2, 6),
 (2, 'fleece hoodie', 'fuzzy, black w/ front pockets', 'outerwear', 'casual wear', Decimal('3'), 'hanging hook near door', 2, 2, 6),
 (5, 'Walk London loafers', 'platform, black, rounded-toe, square design on tongue of shoe', 'shoes', 'multipurpose', Decimal('1'), 'in box', 5, 3, 7),
 (11, '"sun/moon" ring', 'thumb ring (gold)', 'accessory', 'multipurpose', Decimal('4'), 'nightstand', 1, 3, 8),
 (8, '"wings" ring', 'pinky ring (silver)', 'accessory', 'multipurpose', Decimal('4'), 'nightstand', 1, 3, 8),
 (7, 'eagle ring', 'index ring (silver/gold)', 'accessory', 'multipurpose', Decimal('4'), 'nightstand', 1, 3, 8),
 (6, 'thin line ring', 'pinky ring (gold)', 'accessory', 'multipurpose', Decimal('4'), 'nightstand', 1, 3, 8),
 (5, 'Cellular Apple Watch', 'black, knit band', 'accessory', 'multipurpose', Decimal('1'), 'nightstand', 1, 3, 8),
 (10, 'Chuck 70 Vintage Canvas', 'Mid top: parchment/garnet/egret', 'shoes', 'multipurpose', Decimal('1'), 'shoe rack', 5, 3, 9),
 (20, 'Comme des Garcons Chuck Taylor Converse', 'Low top: grey/black', 'shoes', 'multipurpose', Decimal('2'), 'shoe rack', 5, 3, 9),
 (1, 'Batman Chuck Taylor Converse', 'Low top: Black/multi-color', 'shoes', 'casual wear', Decimal('5'), 'shoe rack', 5, 2, 9)]

## Analyses

#### This is the analysis section of the code. Here answers the questions initially posed in the earlier in notebook.

In [12]:
%%sql

-- Select data from wardrobe table and order by years_owned and name
SELECT 
    name,
    category,
    category_id,
    years_owned
    FROM wardrobe
    ORDER BY  years_owned DESC, name;

 * postgresql://postgres:***@localhost:5433/PersonalProjects
20 rows affected.

[('Batman Chuck Taylor Converse', 'shoes', 5, Decimal('5')),
 ('t-shirt', 'shirts', 4, Decimal('5')),
 ('"sun/moon" ring', 'accessory', 1, Decimal('4')),
 ('"wings" ring', 'accessory', 1, Decimal('4')),
 ('Hanes Socks', 'socks', 6, Decimal('4')),
 ('eagle ring', 'accessory', 1, Decimal('4')),
 ('thin line ring', 'accessory', 1, Decimal('4')),
 ('beanie', 'outerwear', 2, Decimal('3')),
 ('fleece hoodie', 'outerwear', 2, Decimal('3')),
 ('lightweight hoodie', 'outerwear', 2, Decimal('3')),
 ('Calvin Klein jean', 'pants', 3, Decimal('2')),
 ('Comme des Garcons Chuck Taylor Converse', 'shoes', 5, Decimal('2')),
 ('Levi 550', 'pants', 3, Decimal('2')),
 ('ribbed shirt', 'shirts', 4, Decimal('2')),
 ('Cellular Apple Watch', 'accessory', 1, Decimal('1')),
 ('Chuck 70 Vintage Canvas', 'shoes', 5, Decimal('1')),
 ('Gold Toe Socks', 'socks', 6, Decimal('1')),
 ('Walk London loafers', 'shoes', 5, Decimal('1')),
 ('computer glasses', 'accessory', 1, Decimal('1')),
 ('hair tie', 'accessory', 1, Decimal('0.5'))]

##### 1. How many items are frequently used in my wardrobe?

In [13]:
%%sql

-- How many items are frequently used in my wardrobe?
SELECT
	COUNT(id)
    FROM wardrobe;

 * postgresql://postgres:***@localhost:5433/PersonalProjects
1 rows affected.

[(20,)]

> ***ANSWER***: There were 20 items in my capsule wardrobe!

##### 2. What are the oldest items that I still frequently use?

In [14]:
%%sql

-- What are the oldests item that I still frequently use?
SELECT
	name, 
    years_owned as oldest_items,
    description
    FROM wardrobe
    WHERE years_owned = (SELECT MAX(years_owned) FROM wardrobe);

 * postgresql://postgres:***@localhost:5433/PersonalProjects
2 rows affected.

[('t-shirt', Decimal('5'), 'plain, white, pocketed'),
 ('Batman Chuck Taylor Converse', Decimal('5'), 'Low top: Black/multi-color')]

> ***ANSWER***: My oldest items are my Batman chucks and my white pocketed t-shirt.

##### 3. What is the average number of years I've own items in your wardrobe by category?

In [15]:
%%sql

-- Find the avg number of years I've own items in your wardrobe by category
SELECT 
    category,
    ROUND(AVG(years_owned),2) as avg_years_owned
    FROM wardrobe
    GROUP BY category
    ORDER BY 2 DESC;

 * postgresql://postgres:***@localhost:5433/PersonalProjects
6 rows affected.

[('shirts', Decimal('3.50')),
 ('outerwear', Decimal('3.00')),
 ('accessory', Decimal('2.64')),
 ('socks', Decimal('2.50')),
 ('shoes', Decimal('2.25')),
 ('pants', Decimal('2.00'))]

> ***ANSWER***: Great news! Most of my most used items, I have had for over 2 years!

###### 4. Where are all my accessories located and how many are in each location?

In [16]:
%%sql

-- Where are all my accessories located and how many are in each location
SELECT 
	DISTINCT(location), 
    COUNT(id) as num_items
    FROM wardrobe
    WHERE category = 'accessory'
    GROUP BY location
    ORDER BY num_items DESC;

 * postgresql://postgres:***@localhost:5433/PersonalProjects
3 rows affected.

[('nightstand', 5), ('bathroom drawer', 1), ('glasses case in backpack', 1)]

> ***ANSWER***: I have 5 items on or in my nightstand; 1 in my bathroom drawer; 1 in my backpack